# Python project
# Using python to extract, transform the extracted data and load them in database for analysis

In [42]:
# Loading data 
# From 4 csv file sources 

import pandas as pd
import numpy as np
import os



# Loading customers.csv
customers_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/customers.csv")

#Loading orders.csv
orders_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/orders.csv")

# Loading products.csv
products_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/products.csv")

# Loading order_details.csv
order_details_df = pd.read_csv("/home/sageGaurab/data-world/retail_data_source/order_details.csv")

In [39]:
# Inspecting source data

# Insepecting directory where source files are 
os.listdir("/home/sageGaurab/data-world/retail_data_source")

['orders.csv', 'customers.csv', 'order_details.csv', 'products.csv']

In [38]:
# Inspecting customers
customers_df.head()

   customer_id                name           city           state signup_date
0            1    Kristen Oconnell  Mckinneyshire  South Carolina  2021-03-25
1            2      Andrea Jenkins   East Lindsay     Mississippi  2023-11-01
2            3        Maureen Hale      Lisamouth        Delaware  2024-02-01
3            4  Mrs. Deborah Smith    Lake Daniel         Montana  2024-08-24
4            5        Lisa Summers    New Bradley         Arizona  2020-11-21

In [5]:
customers_df.tail()

,customer_id,name,city,state,signup_date
1995,1996,Nancy Hernandez,Cartermouth,Indiana,2024-04-08
1996,1997,James Underwood,North Jamesmouth,South Carolina,2024-06-21
1997,1998,Jennifer Walker,Port Larry,North Dakota,2022-11-15
1998,1999,Brett Gibson,Millerport,Nevada,2024-02-13
1999,2000,Thomas Jones,Michaelstad,Nevada,2022-02-18

In [6]:
customers_df.describe()

       customer_id
count  2000.000000
mean   1000.500000
std     577.494589
min       1.000000
25%     500.750000
50%    1000.500000
75%    1500.250000
max    2000.000000

In [9]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  2000 non-null   int64
 1   name         2000 non-null   object
 2   city         2000 non-null   object
 3   state        2000 non-null   object
 4   signup_date  2000 non-null   object
dtypes: int64(1), object(4)
memory usage: 78.3+ KB

In [22]:
# checking shape of a object rows columns
customers_df.shape
customers_df.isna().sum()

customer_id    0
name           0
city           0
state          0
signup_date    0
dtype: int64

In [59]:
customers_df.sample(5)

      customer_id            name             city       state signup_date
1925         1926   David Shaffer  North Brianview  Washington  2023-04-20
1356         1357     Joseph Dunn    Port Johnfurt     Georgia  2025-03-12
1438         1439   Brian Edwards      Theresaside  New Mexico  2023-08-17
627           628   Larry Delgado       New Thomas     Arizona  2025-05-28
1619         1620  Gary Rodriguez         Ryanland    Colorado  2025-03-04

In [28]:
# Inspecting orders.csv
print("_______________ orders.csv ______________________")
print("*************** First five rows *****************")
orders_df.head(5)

_______________ orders.csv ______________________
*************** First five rows *****************

   order_id  customer_id  order_date order_status
0         1         1575  2023-06-24    Cancelled
1         2         1494  2024-03-24    Completed
2         3         1317  2024-06-19    Completed
3         4          587  2025-05-26      Shipped
4         5         1035  2025-09-21    Completed

In [25]:
print("************** Five random rows *****************")
orders_df.sample(5)

************** Five random rows *****************

      order_id  customer_id  order_date order_status
410        411          368  2025-09-05    Cancelled
3589      3590         1809  2024-03-30      Shipped
5047      5048          899  2025-09-18    Completed
2108      2109          790  2025-07-19    Completed
501        502          346  2024-08-25    Cancelled

In [26]:
print("************** info ****************")
orders_df.info()

************** info ****************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8000 entries, 0 to 7999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      8000 non-null   int64
 1   customer_id   8000 non-null   int64
 2   order_date    8000 non-null   object
 3   order_status  8000 non-null   object
dtypes: int64(2), object(2)
memory usage: 250.1+ KB

In [27]:
print("************** describe **************************")
orders_df.describe()

************** describe **************************

         order_id  customer_id
count  8000.00000  8000.000000
mean   4000.50000  1002.041250
std    2309.54541   568.408966
min       1.00000     2.000000
25%    2000.75000   520.000000
50%    4000.50000  1004.500000
75%    6000.25000  1487.000000
max    8000.00000  2000.000000

In [30]:
print("************** isna **********************************")
orders_df.isna().sum()

************** isna **********************************

order_id        0
customer_id     0
order_date      0
order_status    0
dtype: int64

In [41]:
print("_______________ products.csv ____________________")
print("*************** First five rows *****************")

products_df.head(5)

_______________ products.csv ____________________
*************** First five rows *****************

   product_id product_name     category  unit_price  cost_price
0           1         Fear       Sports      382.46      183.93
1           2      Reflect         Food      155.92       33.32
2           3          Pay       Sports      125.81       98.98
3           4      Certain  Electronics      430.43       71.11
4           5      Message         Home      451.39       98.90

In [33]:
print("************** Five random rows ****************")
products_df.sample(5)

************** Five random rows ****************

     product_id product_name     category  unit_price  cost_price
124         125          Lay         Food      298.33       14.21
131         132      Reflect  Electronics      195.17      119.28
168         169     Hospital     Clothing      484.26      225.36
189         190        Ready         Home      252.98      271.55
83           84      Example  Electronics      253.89       99.63

In [58]:
print("*********** checking unique values for prodcut_name *************")
products_df["product_name"].unique()

*********** checking unique values for prodcut_name *************

array(['Fear', 'Reflect', 'Pay', 'Certain', 'Message', 'Country', 'Cold',
       'Very', 'Decide', 'Son', 'Seven', 'Born', 'Have', 'Focus', 'They',
       'Down', 'Health', 'Energy', 'World', 'Argue', 'Road', 'Report',
       'Already', 'Such', 'Specific', 'Hospital', 'Never', 'Change',
       'Debate', 'Entire', 'Their', 'Operation', 'According', 'Political',
       'Smile', 'Position', 'Simply', 'Happen', 'Black', 'Until', 'Deep',
       'Yourself', 'Hand', 'Culture', 'Citizen', 'National', 'Prepare',
       'How', 'Seat', 'Doctor', 'Leg', 'Example', 'Admit', 'Case', 'Race',
       'Daughter', 'Marriage', 'Particular', 'Official', 'Establish',
       'Far', 'Service', 'Our', 'Catch', 'Do', 'Away', 'At', 'After',
       'Child', 'Sport', 'International', 'Later', 'Effect', 'Put',
       'Process', 'Mission', 'Performance', 'Trip', 'Will', 'Fall',
       'There', 'Husband', 'Nation', 'Plant', 'History', 'Success',
       'Drop', 'Manager', 'Weight', 'Table', 'Church', 'Ago',
       'Professional', 'Scene', 'Wife', 'Send', 'Professor', 'Treatment',
       'Spend', 'Understand', 'Language', 'Listen', 'Thing', 'Push',
       'Affect', 'Against', 'Everybody', 'Mention', 'Stand', 'Offer',
       'Another', 'Prove', 'Read', 'Lawyer', 'Support', 'Possible',
       'View', 'Without', 'Lay', 'Financial', 'Drive', 'Much', 'Figure',
       'Pick', 'Yeah', 'Phone', 'Trade', 'Public', 'Wind', 'Three',
       'Shake', 'Off', 'Only', 'Product', 'Indicate', 'Computer', 'Least',
       'Simple', 'Point', 'Difficult', 'Though', 'Carry', 'Lot', 'Issue',
       'Clear', 'Sister', 'Nature', 'Full', 'Different', 'Grow',
       'Purpose', 'Physical', 'Usually', 'Join', 'Important', 'Number',
       'Save', 'Memory', 'Great', 'Small', 'Recently', 'Ability', 'Teach',
       'Increase', 'Ready', 'Development', 'Free', 'Partner',
       'Participant', 'Among', 'Star', 'Box', 'Source', 'Short',
       'Through', 'Large'], dtype=object)

In [34]:
print("************** info ****************")
products_df.info()

************** info ****************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    200 non-null    int64
 1   product_name  200 non-null    object
 2   category      200 non-null    object
 3   unit_price    200 non-null    float64
 4   cost_price    200 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 7.9+ KB

In [36]:
print("************** describe **************************")
products_df.describe()

************** describe **************************

       product_id  unit_price  cost_price
count  200.000000  200.000000  200.000000
mean   100.500000  268.098000  156.580350
std     57.879185  139.641314   90.151055
min      1.000000    8.390000    3.180000
25%     50.750000  151.195000   85.522500
50%    100.500000  284.975000  163.245000
75%    150.250000  392.215000  234.237500
max    200.000000  493.510000  299.940000

In [40]:
print("************** isna **********************************")
products_df.isna().sum()

************** isna **********************************

product_id      0
product_name    0
category        0
unit_price      0
cost_price      0
dtype: int64

In [44]:
print("_______________ orders_detail.csv ______________________")
print("*************** First five rows *****************")
order_details_df.head(5)

_______________ orders_detail.csv ______________________
*************** First five rows *****************

   order_id  product_id  quantity  discount
0      4241         169         5      0.09
1      4212          24         6      0.01
2      6617         199         7      0.19
3      1144          23         6      0.17
4       585          61         9      0.03

In [46]:
print("************** Five random rows ****************")
order_details_df.sample(5)

************** Five random rows ****************

      order_id  product_id  quantity  discount
1196      2569         187         7      0.08
9169      1437          33         9      0.29
876       1015          83         4      0.20
484       6666         177         6      0.23
2566      3850         164         7      0.07

In [47]:
print("************** info ****************")
order_details_df.info()

************** info ****************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    10000 non-null  int64
 1   product_id  10000 non-null  int64
 2   quantity    10000 non-null  int64
 3   discount    10000 non-null  float64
dtypes: float64(1), int64(3)
memory usage: 312.6 KB

In [48]:
print("************** describe **************************")
order_details_df.describe()

************** describe **************************

           order_id    product_id     quantity      discount
count  10000.000000  10000.000000  10000.00000  10000.000000
mean    4005.042500    100.332100      4.98980      0.150309
std     2317.886477     57.938408      2.56085      0.087626
min        1.000000      1.000000      1.00000      0.000000
25%     1986.000000     49.000000      3.00000      0.070000
50%     3978.000000    101.000000      5.00000      0.150000
75%     6015.000000    150.000000      7.00000      0.230000
max     8000.000000    200.000000      9.00000      0.300000

In [53]:
print("************** isna **********************************")
order_details_df.isna().sum()

************** isna **********************************

order_id      0
product_id    0
quantity      0
discount      0
dtype: int64

In [55]:
order_details_df.shape

(10000, 4)